# Задание 1
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
c = int(input("Введите третье число: "))
# Задание 1.1
min_num = min(a, b, c)
print("Наименьшее число: ", min_num)