# Задание 1.3
m = float(input("Введите число: "))

for i in range(1, 11):
    result = i*m
    print(result)